## 1. Import Necessary Libraries
<div style="text-align: center;">
    <img src="mexican_house_1.jpg" alt="mexican-house_1" style="width: 60%; height: auto;">
</div>

In [1]:
import pandas as pd

## 2. Load The Data

In [2]:
df1 = pd.read_csv("data/mexico-real-estate-1.csv", encoding='ISO-8859-1')
df2 = pd.read_csv("data/mexico-real-estate-2.csv", encoding='ISO-8859-1')
df3 = pd.read_csv("data/mexico-real-estate-3.csv", encoding='ISO-8859-1')

print(f'df1 shape: {df1.shape}\n')
print(f'df2 shape: {df2.shape}\n')
print(f'df3 shape: {df3.shape}\n')

df1 shape: (700, 6)

df2 shape: (700, 6)

df3 shape: (700, 5)

## 3. Cleaning Process

### a. Clean `df1`

Let's first inspect the `df1` by using the `info()` method to see the data types and number of missing values for each column, and the `head` method to view the first few rows.

In [3]:
# Print the info regarding the df1
print(df1.info())
print("\n")

# Print the first few rows
df1.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_usd      700 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 32.9+ KB
None

,property_type,state,lat,lon,area_m2,price_usd
0,house,Estado de México,19.560181,-99.233528,150,"$67,965.56"
1,house,Nuevo León,25.688436,-100.198807,186,"$63,223.78"
2,apartment,Guerrero,16.767704,-99.764383,82,"$84,298.37"
3,apartment,Guerrero,16.829782,-99.911012,150,"$94,308.80"
4,house,Veracruz de Ignacio de la Llave,NaN,NaN,175,"$94,835.67"

**Drop NaN Values** in the `df1`

In [4]:
# Copy df1
df1_new = df1.copy()

# Drop NaN Values
df1_new.dropna(inplace=True)

# Reset index
df1_new.reset_index(drop=True, inplace=True)

# Check Null values in the dataframe
print(f'{df1_new.info()}\n')

# Number of dropped rows in the "df1"
df1_length = len(df1)
new_df1_length = len(df1_new)
print(f'Number of dropped rows from the df1 = {df1_length - new_df1_length} rows \n')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 583 entries, 0 to 582
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    int64
 5   price_usd      583 non-null    object
dtypes: float64(2), int64(1), object(3)
memory usage: 27.5+ KB
None

Number of dropped rows from the df1 = 117 rows

In [5]:
# View first few rows of "price_usd"
df1_new["price_usd"].head()

0     $67,965.56
1     $63,223.78
2     $84,298.37
3     $94,308.80
4    $105,191.37
Name: price_usd, dtype: object

**Remove** the `"$"` and `","` characters from `"price_usd"` then **recast** the values in the column as floats.

In [6]:
# Clean "price_usd" column
df1_new["price_usd"] = (
    df1_new["price_usd"].
    str.replace("$", "", regex=False).
    str.replace(",", "", regex=False).
    astype("float")
)

print(df1_new.info())
df1_new.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 583 entries, 0 to 582
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  583 non-null    object
 1   state          583 non-null    object
 2   lat            583 non-null    float64
 3   lon            583 non-null    float64
 4   area_m2        583 non-null    int64
 5   price_usd      583 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 27.5+ KB
None

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528      150   67965.56
1         house        Nuevo León  25.688436 -100.198807      186   63223.78
2     apartment          Guerrero  16.767704  -99.764383       82   84298.37
3     apartment          Guerrero  16.829782  -99.911012      150   94308.80
4         house           Yucatán  21.052583  -89.538639      205  105191.37

---------------

### b. Clean `df2`

In [7]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  700 non-null    object
 1   state          700 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        700 non-null    int64
 5   price_mxn      700 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 32.9+ KB

In [8]:
# Copy df2
df2_new = df2.copy()

# Drop NaN Values
df2_new.dropna(inplace=True)

# reset index
df2_new.reset_index(drop=True, inplace=True)

# View info
print(df2_new.info())

# Number of dropped rows in the "df1"
df2_length = len(df2)
new_df2_length = len(df2_new)
print(f'Number of dropped rows from the df2 = {df2_length - new_df2_length} rows \n')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 571 entries, 0 to 570
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  571 non-null    object
 1   state          571 non-null    object
 2   lat            571 non-null    float64
 3   lon            571 non-null    float64
 4   area_m2        571 non-null    int64
 5   price_mxn      571 non-null    int64
dtypes: float64(2), int64(2), object(2)
memory usage: 26.9+ KB
None
Number of dropped rows from the df2 = 129 rows

The home prices are in Mexican pesos (`"price_mxn"`), not US dollars (`"price_usd"`). If we want to compare all the home prices in this dataset, they all need to be in the same currency.
Next, use the "price_mxn" column to create a new column named "price_usd". (Keep in mind that, when this data was collected in 2014, a dollar cost **19 pesos.**) Finally, drop the "price_mxn" from the DataFrame.

In [9]:
# Convert from pesos to dollar, and store them in "price_usd" column
df2_new["price_usd"] = (df2_new["price_mxn"] / 19).round(2)

# drop "price_mxn"
df2_new.drop(columns=["price_mxn"], inplace=True)

# view the first few rows
df2_new.head()

  property_type             state        lat         lon  area_m2  price_usd
0     apartment        Nuevo León  25.721081 -100.345581       72   68421.05
1         house           Morelos  23.634501 -102.552788      360  278947.37
2     apartment  Estado de México  19.272040  -99.572013       85   65789.47
3         house   San Luis Potosí  22.138882 -100.996510      158  111578.95
4     apartment  Distrito Federal  19.394558  -99.129707       65   39904.74

### c. Clean `df3`

In [10]:
# view "df3" info
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            700 non-null    object
 1   place_with_parent_names  700 non-null    object
 2   lat-lon                  582 non-null    object
 3   area_m2                  700 non-null    int64
 4   price_usd                700 non-null    float64
dtypes: float64(1), int64(1), object(3)
memory usage: 27.5+ KB

In [11]:
# Copy "df3"
df3_new = df3.copy()

In [12]:
# Split the "lat-lon" column, and save them into two columns "lat" and "lon"
df3_new[["lat", "lon"]]= df3_new["lat-lon"].str.split(",", expand=True).astype("float")

# Drop the "lat-lon" column
df3_new.drop(columns=["lat-lon"], inplace=True)

# Drop rows with NaNs from the dataframe
df3_new.dropna(inplace=True)

# Reset the index of dtaframe 
df3_new.reset_index(drop=True, inplace=True)

# View "df3" info
df3_new.info()

# View the first few rows of the "df3"
df3_new.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 582 entries, 0 to 581
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   property_type            582 non-null    object
 1   place_with_parent_names  582 non-null    object
 2   area_m2                  582 non-null    int64
 3   price_usd                582 non-null    float64
 4   lat                      582 non-null    float64
 5   lon                      582 non-null    float64
dtypes: float64(3), int64(1), object(2)
memory usage: 27.4+ KB

,property_type,place_with_parent_names,area_m2,price_usd,lat,lon
0,apartment,|México|Distrito Federal|Gustavo A. Madero|Acu...,71,48550.59,19.525890,-99.151703
1,house,|México|Estado de México|Toluca|Metepec|,233,168636.73,19.264054,-99.572753
2,house,|México|Estado de México|Toluca|Toluca de Lerd...,300,86932.69,19.268629,-99.671722
3,apartment,|México|Veracruz de Ignacio de la Llave|Veracruz|,84,68508.67,19.511938,-96.871956
4,house,|México|Jalisco|Guadalajara|,175,102763.00,20.689157,-103.366728

Get "state" from the "place_with_parent_names" column

In [13]:
# Get state from the "place_with_parent_names" column
df3_new["state"] = df3_new["place_with_parent_names"].str.split("|", expand=True)[2]

# Drop "place_with_parent_names" column from "df3"
df3_new.drop(columns=["place_with_parent_names"], inplace=True)

# View the first few rows
df3_new.head()

,property_type,area_m2,price_usd,lat,lon,state
0,apartment,71,48550.59,19.525890,-99.151703,Distrito Federal
1,house,233,168636.73,19.264054,-99.572753,Estado de México
2,house,300,86932.69,19.268629,-99.671722,Estado de México
3,apartment,84,68508.67,19.511938,-96.871956,Veracruz de Ignacio de la Llave
4,house,175,102763.00,20.689157,-103.366728,Jalisco

## 4. Concatenate Dataframes

In [14]:
# Put all the cleaned dataframes in a list
dfs_list = [df1_new, df2_new, df3_new]

# Concate the dataframes
df = pd.concat(dfs_list, axis=0)

print(f'Dataframe Shape: {df.shape}')
print(df.info())
df.head()

Dataframe Shape: (1736, 6)
<class 'pandas.core.frame.DataFrame'>
Int64Index: 1736 entries, 0 to 581
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  1736 non-null   object
 1   state          1736 non-null   object
 2   lat            1736 non-null   float64
 3   lon            1736 non-null   float64
 4   area_m2        1736 non-null   int64
 5   price_usd      1736 non-null   float64
dtypes: float64(3), int64(1), object(2)
memory usage: 94.9+ KB
None

  property_type             state        lat         lon  area_m2  price_usd
0         house  Estado de México  19.560181  -99.233528      150   67965.56
1         house        Nuevo León  25.688436 -100.198807      186   63223.78
2     apartment          Guerrero  16.767704  -99.764383       82   84298.37
3     apartment          Guerrero  16.829782  -99.911012      150   94308.80
4         house           Yucatán  21.052583  -89.538639      205  105191.37

## 5. Save Dataframe

In [15]:
df.to_csv("data/mexico-real-estate-clean.csv", index=False)